<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<title>:::: 음력/양력 변환 ::::</title>
<meta http-equiv="Content-Type" content="text/html" charset="EUC-KR">
<script type="text/javascript">

// 숫자인지만 체크
function f_Number(str) {
       for (i=0; i< str.length; i++) {
               ch = str.charAt(i);
               if (ch < "0" || ch > "9") {
                       return false;
               }
       }
       return true;
}
function Resut() {

       // 입력된 날짜가 8 자리인지 check
       if ((document.frmTest.input_day.value.length != 8) || (f_Number(document.frmTest.input_day.value) == false)) {
                alert('올바른 일자를 입력해주세요.');
                document.frmTest.input_day.focus();
                 }

        else {
        // 음력 데이터 (평달 - 작은달 :1,  큰달:2 )
        // (윤달이 있는 달 - 평달이 작고 윤달도 작으면 :3 , 평달이 작고 윤달이 크면 : 4)
        // (윤달이 있는 달 - 평달이 크고 윤달이 작으면 :5,  평달과 윤달이 모두 크면 : 6)
var kk = [[1, 2, 4, 1, 1, 2, 1, 2, 1, 2, 2, 1],   /* 1841 */
         [2, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 1],
         [2, 2, 2, 1, 2, 1, 4, 1, 2, 1, 2, 1],
         [2, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2],
         [1, 2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1],
         [2, 1, 2, 1, 5, 2, 1, 2, 2, 1, 2, 1],
         [2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 1, 2],
         [1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 1],
         [2, 1, 2, 3, 2, 1, 2, 1, 2, 1, 2, 2],
         [2, 1, 2, 1, 1, 2, 1, 1, 2, 2, 1, 2],
         [2, 2, 1, 2, 1, 1, 2, 1, 2, 1, 5, 2],   /* 1851 */
         [2, 1, 2, 2, 1, 1, 2, 1, 2, 1, 1, 2],
         [2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2],
         [1, 2, 1, 2, 1, 2, 5, 2, 1, 2, 1, 2],
         [1, 1, 2, 1, 2, 2, 1, 2, 2, 1, 2, 1],
         [2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 1, 2],
         [1, 2, 1, 1, 5, 2, 1, 2, 1, 2, 2, 2],
         [1, 2, 1, 1, 2, 1, 1, 2, 2, 1, 2, 2],
         [2, 1, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2],
         [2, 1, 6, 1, 1, 2, 1, 1, 2, 1, 2, 2],
         [1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 1, 2],   /* 1861 */
         [2, 1, 2, 1, 2, 2, 1, 2, 2, 3, 1, 2],
         [1, 2, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2],
         [1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1],
         [2, 1, 1, 2, 4, 1, 2, 2, 1, 2, 2, 1],
         [2, 1, 1, 2, 1, 1, 2, 2, 1, 2, 2, 2],
         [1, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 2],
         [1, 2, 2, 3, 2, 1, 1, 2, 1, 2, 2, 1],
         [2, 2, 2, 1, 1, 2, 1, 1, 2, 1, 2, 1],
         [2, 2, 2, 1, 2, 1, 2, 1, 1, 5, 2, 1],
         [2, 2, 1, 2, 2, 1, 2, 1, 2, 1, 1, 2],   /* 1871 */
         [1, 2, 1, 2, 2, 1, 2, 1, 2, 2, 1, 2],
         [1, 1, 2, 1, 2, 4, 2, 1, 2, 2, 1, 2],
         [1, 1, 2, 1, 2, 1, 2, 1, 2, 2, 2, 1],
         [2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 2, 1],
         [2, 2, 1, 1, 5, 1, 2, 1, 2, 2, 1, 2],
         [2, 2, 1, 1, 2, 1, 1, 2, 1, 2, 1, 2],
         [2, 2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1],
         [2, 2, 4, 2, 1, 2, 1, 1, 2, 1, 2, 1],
         [2, 1, 2, 2, 1, 2, 2, 1, 2, 1, 1, 2],
         [1, 2, 1, 2, 1, 2, 5, 2, 2, 1, 2, 1],   /* 1881 */
         [1, 2, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2],
         [1, 1, 2, 1, 1, 2, 1, 2, 2, 2, 1, 2],
         [2, 1, 1, 2, 3, 2, 1, 2, 2, 1, 2, 2],
         [2, 1, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2],
         [2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2],
         [2, 2, 1, 5, 2, 1, 1, 2, 1, 2, 1, 2],
         [2, 1, 2, 2, 1, 2, 1, 1, 2, 1, 2, 1],
         [2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2],
         [1, 5, 2, 1, 2, 2, 1, 2, 1, 2, 1, 2],
         [1, 2, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2],   /* 1891 */
         [1, 1, 2, 1, 1, 5, 2, 2, 1, 2, 2, 2],
         [1, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2],
         [1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2],
         [2, 1, 2, 1, 5, 1, 2, 1, 2, 1, 2, 1],
         [2, 2, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2],
         [1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1],
         [2, 1, 5, 2, 2, 1, 2, 1, 2, 1, 2, 1],
         [2, 1, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2],
         [1, 2, 1, 1, 2, 1, 2, 5, 2, 2, 1, 2],
         [1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 1],   /* 1901 */
         [2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2],
         [1, 2, 1, 2, 3, 2, 1, 1, 2, 2, 1, 2],
         [2, 2, 1, 2, 1, 1, 2, 1, 1, 2, 2, 1],
         [2, 2, 1, 2, 2, 1, 1, 2, 1, 2, 1, 2],
         [1, 2, 2, 4, 1, 2, 1, 2, 1, 2, 1, 2],
         [1, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 1],
         [2, 1, 1, 2, 2, 1, 2, 1, 2, 2, 1, 2],
         [1, 5, 1, 2, 1, 2, 1, 2, 2, 2, 1, 2],
         [1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 1],
         [2, 1, 2, 1, 1, 5, 1, 2, 2, 1, 2, 2],   /* 1911 */
         [2, 1, 2, 1, 1, 2, 1, 1, 2, 2, 1, 2],
         [2, 2, 1, 2, 1, 1, 2, 1, 1, 2, 1, 2],
         [2, 2, 1, 2, 5, 1, 2, 1, 2, 1, 1, 2],
         [2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2],
         [1, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 1],
         [2, 3, 2, 1, 2, 2, 1, 2, 2, 1, 2, 1],
         [2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 1, 2],
         [1, 2, 1, 1, 2, 1, 5, 2, 2, 1, 2, 2],
         [1, 2, 1, 1, 2, 1, 1, 2, 2, 1, 2, 2],
         [2, 1, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2],   /* 1921 */
         [2, 1, 2, 2, 3, 2, 1, 1, 2, 1, 2, 2],
         [1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 1, 2],
         [2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 1, 1],
         [2, 1, 2, 5, 2, 1, 2, 2, 1, 2, 1, 2],
         [1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1],
         [2, 1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2],
         [1, 5, 1, 2, 1, 1, 2, 2, 1, 2, 2, 2],
         [1, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 2],
         [1, 2, 2, 1, 1, 5, 1, 2, 1, 2, 2, 1],
         [2, 2, 2, 1, 1, 2, 1, 1, 2, 1, 2, 1],   /* 1931 */
         [2, 2, 2, 1, 2, 1, 2, 1, 1, 2, 1, 2],
         [1, 2, 2, 1, 6, 1, 2, 1, 2, 1, 1, 2],
         [1, 2, 1, 2, 2, 1, 2, 2, 1, 2, 1, 2],
         [1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1],
         [2, 1, 4, 1, 2, 1, 2, 1, 2, 2, 2, 1],
         [2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 2, 1],
         [2, 2, 1, 1, 2, 1, 4, 1, 2, 2, 1, 2],
         [2, 2, 1, 1, 2, 1, 1, 2, 1, 2, 1, 2],
         [2, 2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1],
         [2, 2, 1, 2, 2, 4, 1, 1, 2, 1, 2, 1],   /* 1941 */
         [2, 1, 2, 2, 1, 2, 2, 1, 2, 1, 1, 2],
         [1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1, 2],
         [1, 1, 2, 4, 1, 2, 1, 2, 2, 1, 2, 2],
         [1, 1, 2, 1, 1, 2, 1, 2, 2, 2, 1, 2],
         [2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 1, 2],
         [2, 5, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2],
         [2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2],
         [2, 2, 1, 2, 1, 2, 3, 2, 1, 2, 1, 2],
         [2, 1, 2, 2, 1, 2, 1, 1, 2, 1, 2, 1],
         [2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2],   /* 1951 */
         [1, 2, 1, 2, 4, 2, 1, 2, 1, 2, 1, 2],
         [1, 2, 1, 1, 2, 2, 1, 2, 2, 1, 2, 2],
         [1, 1, 2, 1, 1, 2, 1, 2, 2, 1, 2, 2],
         [2, 1, 4, 1, 1, 2, 1, 2, 1, 2, 2, 2],
         [1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2],
         [2, 1, 2, 1, 2, 1, 1, 5, 2, 1, 2, 2],
         [1, 2, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2],
         [1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1],
         [2, 1, 2, 1, 2, 5, 2, 1, 2, 1, 2, 1],
         [2, 1, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2],   /* 1961 */
         [1, 2, 1, 1, 2, 1, 2, 2, 1, 2, 2, 1],
         [2, 1, 2, 3, 2, 1, 2, 1, 2, 2, 2, 1],
         [2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2],
         [1, 2, 1, 2, 1, 1, 2, 1, 1, 2, 2, 1],
         [2, 2, 5, 2, 1, 1, 2, 1, 1, 2, 2, 1],
         [2, 2, 1, 2, 2, 1, 1, 2, 1, 2, 1, 2],
         [1, 2, 2, 1, 2, 1, 5, 2, 1, 2, 1, 2],
         [1, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 1],
         [2, 1, 1, 2, 2, 1, 2, 1, 2, 2, 1, 2],
         [1, 2, 1, 1, 5, 2, 1, 2, 2, 2, 1, 2],   /* 1971 */
         [1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 1],
         [2, 1, 2, 1, 1, 2, 1, 1, 2, 2, 2, 1],
         [2, 2, 1, 5, 1, 2, 1, 1, 2, 2, 1, 2],
         [2, 2, 1, 2, 1, 1, 2, 1, 1, 2, 1, 2],
         [2, 2, 1, 2, 1, 2, 1, 5, 2, 1, 1, 2],
         [2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 1],
         [2, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 1],
         [2, 1, 1, 2, 1, 6, 1, 2, 2, 1, 2, 1],
         [2, 1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2],
         [1, 2, 1, 1, 2, 1, 1, 2, 2, 1, 2, 2],   /* 1981 */
         [2, 1, 2, 3, 2, 1, 1, 2, 2, 1, 2, 2],
         [2, 1, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2],
         [2, 1, 2, 2, 1, 1, 2, 1, 1, 5, 2, 2],
         [1, 2, 2, 1, 2, 1, 2, 1, 1, 2, 1, 2],
         [1, 2, 2, 1, 2, 2, 1, 2, 1, 2, 1, 1],
         [2, 1, 2, 2, 1, 5, 2, 2, 1, 2, 1, 2],
         [1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1],
         [2, 1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2],
         [1, 2, 1, 1, 5, 1, 2, 1, 2, 2, 2, 2],
         [1, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 2],   /* 1991 */
         [1, 2, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2],
         [1, 2, 5, 2, 1, 2, 1, 1, 2, 1, 2, 1],
         [2, 2, 2, 1, 2, 1, 2, 1, 1, 2, 1, 2],
         [1, 2, 2, 1, 2, 2, 1, 5, 2, 1, 1, 2],
         [1, 2, 1, 2, 2, 1, 2, 1, 2, 2, 1, 2],
         [1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1],
         [2, 1, 1, 2, 3, 2, 2, 1, 2, 2, 2, 1],
         [2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 2, 1],
         [2, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 1],
         [2, 2, 2, 3, 2, 1, 1, 2, 1, 2, 1, 2],   /* 2001 */
         [2, 2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1],
         [2, 2, 1, 2, 2, 1, 2, 1, 1, 2, 1, 2],
         [1, 5, 2, 2, 1, 2, 1, 2, 2, 1, 1, 2],
         [1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1, 2],
         [1, 1, 2, 1, 2, 1, 5, 2, 2, 1, 2, 2],
         [1, 1, 2, 1, 1, 2, 1, 2, 2, 2, 1, 2],
         [2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 1, 2],
         [2, 2, 1, 1, 5, 1, 2, 1, 2, 1, 2, 2],
         [2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2],
         [2, 1, 2, 2, 1, 2, 1, 1, 2, 1, 2, 1],   /* 2011 */
         [2, 1, 6, 2, 1, 2, 1, 1, 2, 1, 2, 1],
         [2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2],
         [1, 2, 1, 2, 1, 2, 1, 2, 5, 2, 1, 2],
         [1, 2, 1, 1, 2, 1, 2, 2, 2, 1, 2, 2],
         [1, 1, 2, 1, 1, 2, 1, 2, 2, 1, 2, 2],
         [2, 1, 1, 2, 3, 2, 1, 2, 1, 2, 2, 2],
         [1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2],
         [2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2],
         [2, 1, 2, 5, 2, 1, 1, 2, 1, 2, 1, 2],
         [1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1],   /* 2021 */
         [2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 1, 2],
         [1, 5, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2],
         [1, 2, 1, 1, 2, 1, 2, 2, 1, 2, 2, 1],
         [2, 1, 2, 1, 1, 5, 2, 1, 2, 2, 2, 1],
         [2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2],
         [1, 2, 1, 2, 1, 1, 2, 1, 1, 2, 2, 2],
         [1, 2, 2, 1, 5, 1, 2, 1, 1, 2, 2, 1],
         [2, 2, 1, 2, 2, 1, 1, 2, 1, 1, 2, 2],
         [1, 2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1],
         [2, 1, 5, 2, 1, 2, 2, 1, 2, 1, 2, 1],   /* 2031 */
         [2, 1, 1, 2, 1, 2, 2, 1, 2, 2, 1, 2],
         [1, 2, 1, 1, 2, 1, 5, 2, 2, 2, 1, 2],
         [1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 1],
         [2, 1, 2, 1, 1, 2, 1, 1, 2, 2, 1, 2],
         [2, 2, 1, 2, 1, 4, 1, 1, 2, 1, 2, 2],
         [2, 2, 1, 2, 1, 1, 2, 1, 1, 2, 1, 2],
         [2, 2, 1, 2, 1, 2, 1, 2, 1, 1, 2, 1],
         [2, 2, 1, 2, 5, 2, 1, 2, 1, 2, 1, 1],
         [2, 1, 2, 2, 1, 2, 2, 1, 2, 1, 2, 1],
         [2, 1, 1, 2, 1, 2, 2, 1, 2, 2, 1, 2],   /* 2041 */
         [1, 5, 1, 2, 1, 2, 1, 2, 2, 2, 1, 2],
         [1, 2, 1, 1, 2, 1, 1, 2, 2, 1, 2, 2]];

          var input_day = document.frmTest.input_day.value;
          var gan = new Array("甲","乙","丙","丁","戊","己","庚","辛","壬","癸");
                var jee = new Array("子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥");
                var ddi = new Array("쥐","소","범","토끼","용","뱀","말","양","원숭이","닭","개","돼지");
                var week = new Array("일","월","화","수","목","금","토");

                var md = new Array(31,0,31,30,31,30,31,31,30,31,30,31);

                var year =input_day.substring(0,4);
                var month =input_day.substring(4,6);
                var day =input_day.substring(6,8);

      if (document.frmTest.sollun[0].checked) {

                // 양력을 음력으로 변환
                var ly, lm, ld;
                var sy, sm, sd;
                var m1, m2, mm, i, j, w;
                dt = new Array(203);
                var k1, k2, td, td1, td2, yoon;

                // 기준일자 양력 1841 년 1 월 23 일 (음력 1840 년 1 월 1 일) 계산
                td1=(1840*365)+(1840/4)-(1840/100)+(1840/400)+23;
                sy = get_year(year);           // 년도 check
                sm = get_month(month);         // 월 check
                md[1] = febdays(sy);           // 윤년 check
                sd = get_day(day,md[sm-1]);    // 일수 check
                var sy1 = sy-1;
                td2 = sy1*365+sy1/4-sy1/100+sy1/400+parseInt(sd);

                 for (i=0; i<sm-1; i++) {
                       td2 = td2 + md[i];
                 }
                td =  td2 - td1 + 1;
                td = make_data(td);

                for (i=0; i<=sy-1841; i++) {
                       dt[i] =0;
                       for(j=0; j<12; j++) {
                               switch(kk[i][j]) {
                                       case 1 :
                                                   mm=29;
                                                   break;
                                       case 2 :
                                                   mm=30;
                                                   break;
                                       case 3 :
                                                   mm=58;     // 29+29
                                                   break;
                                       case 4 :
                                                   mm=59;     // 29+30
                                                   break;
                                       case 5 :
                                                   mm=59;     // 30+29
                                                   break;
                                       case 6 :
                                                   mm=60;     // 30+30
                                                   break;
                                       }
                                dt[i] = dt[i] + mm;
                       }
                }
                ly =0 ;
                while(1) {
                       if (td > dt[ly] ) {
                               td = td - dt[ly];
                               ly=ly+1;
                       }
                       else {
                               break;
                       }
                 }
                 lm=0;
                 yoon = "";
                 while(1) {
                       if (kk[ly][lm] <=2) {
                               mm = kk[ly][lm] +28;
                               if (td>mm) {
                                          td = td - mm;
                                          lm = lm +1;
                                }
                                else {
                                       break;
                                }
                       }
                       else {
                               switch (kk[ly][lm]) {
                                       case 3:
                                                   m1 = 29;
                                                   m2 = 29;
                                                   break;
                                       case 4:
                                                   m1 = 29;
                                                   m2 = 30;
                                                   break;
                                       case 5:
                                                   m1 = 30;
                                                   m2 = 29;
                                                   break;
                                       case 6:
                                                   m1 = 30;
                                                   m2 = 30;
                                                   break;
                                 }
                                 if (td>m1) {
                                       td = td - m1;
                                           if (td>m2) {
                                                   td = td - m2;
                                                   lm=lm+1;
                                           }
                                           else {
                                                   yoon ="윤";
                                                   break;
                                           }
                                  }
                                  else {
                                       break;
                                  }
                          }
                    }
                    ly = ly + 1841;
                    lm = lm + 1;
                    ld = td;
                    w = (parseInt(td2)) % 7;
                    i = (parseInt(td2)+4) % 10;
                    j = (parseInt(td2)+2) % 12;
                    k1 = (parseInt(ly)+6) %10;
                    k2 = (parseInt(ly)+8) % 12;
                                                            document.write("<br><br><center>");
                    document.writeln("양력 ",sy," 년 ",sm," 월 ",sd," 일 ",week[w],"요일","<br>");
                    document.write("음력 ",gan[k1],jee[k2],"년 ",ddi[k2],"띠",yoon,"해 ",ly," 년 ",lm," 월 ",ld," 일 ","(",gan[i],jee[j],")");
                    document.write("<br><br><a href='#' onclick='history.go(-1);'>돌아 가기</a>");
                  }

                  else if (document.frmTest.sollun[1].checked) {
                   // 음력에서 양력으로 변환
                   var lyear, lmonth, lday, leapyes;
                   var syear, smonth, sday;
                   var mm, y1, y2, m1;
                   var i, j, k1, k2, leap, w;
                   var td, y;
                   lyear = get_year(year);        // 년도 check
                   lmonth = get_month(month);     // 월 check

                   y1 = lyear - 1841;
                   m1 = lmonth - 1;
                   leapyes = 0;
                   if (kk[y1][m1] > 2)  {
                          if (document.frmTest.yoon[0].checked) {
                                   leapyes = 1;
                                   switch (kk[y1][m1]) {
                                               case 3:
                                               case 5:
                                                       mm = 29;
                                                       break;
                                               case 4:
                                               case 6:
                                                       mm = 30;
                                                       break;
                                    }
                          }
                          else {
                                   switch (kk[y1][m1]) {
                                           case 1:
                                           case 3:
                                           case 4:
                                                   mm = 29;
                                                   break;
                                           case 2:
                                           case 5:
                                           case 6:
                                                   mm = 30;
                                                   break;
                                    }
                         }
                   }

                  lday = get_day(day, mm);

                  td = 0;
                  for (i=0; i<y1; i++) {
                           for (j=0; j<12; j++) {
                                       switch (kk[i][j]) {
                                               case 1:
                                                       td = td + 29;
                                                       break;
                                               case 2:
                                                       td = td + 30;
                                                       break;
                                               case 3:
                                                       td = td + 58;    // 29+29
                                                       break;
                                               case 4:
                                                       td = td + 59;    // 29+30
                                                       break;
                                               case 5:
                                                       td = td + 59;    // 30+29
                                                       break;
                                               case 6:
                                                       td = td + 60;    // 30+30
                                                       break;
                                       }
                           }
                }
                for (j=0; j<m1; j++) {
                       switch (kk[y1][j]) {
                               case 1:
                                       td = td + 29;
                                       break;
                               case 2:
                                       td = td + 30;
                                       break;
                               case 3:
                                       td = td + 58;    // 29+29
                                       break;
                               case 4:
                                       td = td + 59;    // 29+30
                                       break;
                               case 5:
                                       td = td + 59;    // 30+29
                                       break;
                               case 6:
                                       td = td + 60;    // 30+30
                                       break;
                       }
                 }
                 if (leapyes == 1) {
                       switch(kk[y1][m1]) {
                               case 3:
                               case 4:
                                       td = td + 29;
                                       break;
                               case 5:
                               case 6:
                                       td = td + 30;
                                       break;
                        }
                 }
                 td =  td + parseFloat(lday) + 22;
                 // td : 1841 년 1 월 1 일 부터 원하는 날짜까지의 전체 날수의 합
                 y1 = 1840;
                 do {
                       y1 = y1 +1;
                       if  ((y1 % 400 == 0) || ((y1 % 100 != 0) && (y1 % 4 == 0))) {
                               y2 = 366;
                       }
                       else {
                               y2 = 365;
                       }
                       if (td <= y2) {
                               break;
                       }
                       else {
                               td = td- y2;
                       }
                } while(1);
                   syear = y1;
                   md[1] = parseInt(y2) -337;
                   m1 = 0;
                   do {
                       m1= m1 + 1;
                       if (td <= md[m1-1]) {
                           break;
                       }
                       else {
                           td = td - md[m1-1];
                       }
                  } while(1);
                  smonth = parseInt(m1);
                  sday = parseInt(td);
                  y = parseInt(syear -1);
                  td = y * 365 + y/4 - y/100 +  y/400;
                  for ( i=0; i<smonth-1; i++) {
                       td = td + md[i];
                  }
                  td = make_data(td) + sday;
                  w = td % 7;
                  i = (td + 4) % 10;
                  j = (td + 2) % 12;
                  k1 = (parseInt(lyear) + 6) % 10;
                  k2 =(parseInt(lyear) + 8) % 12;
                  document.write("<br><br><center>");
                                                  document.write("음력 ",gan[k1],jee[k2],"년 ",ddi[k2],"띠해 ",lyear," 년 ",lmonth," 월 ",lday," 일 ","(",gan[i],jee[j],")","<br>");
                  document.write("양력 ",syear," 년 ",smonth," 월 ",sday," 일 ",week[w],"요일");
                  document.write("<br><br><a href='#' onclick='history.go(-1);'>돌아 가기</a>");
                }
       }
}
function get_year(src) {
        if ((src < 1841) || (src > 2043 )) {
           alert('연도 범위는 1841 ~ 2043 까지입니다.');
           document.frmTest.input_day.focus();
        }
        else
           return src;
}
function get_month(src) {
        if ((src < 1) || (src > 12 )) {
            alert('월 범위는 1 ~ 12 까지입니다.');
            document.frmTest.input_day.focus();
        }
        else
            return src;
}
function get_day(src,day) {
        if ((src < 1) || (src > day )) {
            alert('일 범위가 틀립니다.');
            document.frmTest.input_day.focus();
        }
        else
            return src;
}
function febdays(src) {
        if ((src%4 !=0) || ((src%100 == 0) && (src%400 !=0))) {
                    return 28;          // 윤년이 아님
        }
        else {                          // 윤년임

                    return  29;
        }
}

</script>

<script type="text/javascript">
function make_data(elm)
       make_data = int(cstr(elm))
end function
</script>


</head>
<body text="#FFFFFF" leftmargin="0" topmargin="0" bgcolor="#FFFFFF">
<p align="center"> </p>
<table width="500" border="1" cellspacing="1" cellpadding="5" bordercolor="#999999" align="center">
 <tr>
   <td bgcolor="#FCFCFC" width="497"> 
     <table width="484" border="0" cellpadding="3" cellspacing="1" align="center">
       <form name="frmTest">
         <tr> 
           <td width="483" height="70"> <font color="#000000" size="2" face="돋움">음력날짜를 
             양력날짜로 혹은 양력날짜를 음력으로 알려주는 코너입니다. <br>
             년월일을 입력하고, 양력 혹은 음력을 선택하시고 변환을 누르시면 음양력변환이 됩니다. 윤달이신 경우에는 체크버튼을 
             선택하시고 변환을 하면 됩니다.<br>
             <font color="#0000FF"><b>예) 20021001</b></font></font> </td>
         </tr>
         <tr> 
           <td width="483"> 
             <table width="72%" border="0" cellspacing="1" cellpadding="3" align="center" bgcolor="#000000">
               <tr bgcolor="#B1E0F1"> 
                 <td width="28%"> 
                   <div align="center"> 
                       <font color="#000000"><input type="text" name="input_day" maxlength="8" size="8">
                       </font></div>
                   </td>
                   
                 <td width="20%"> 
                   <div align="center"> <font color="#000000">  
                       <input type="radio" name="sollun" value="sol2lun" checked>
                     <font size="2" face="돋움">양</font></font></div>
                   </td>
                   
                 <td width="22%"> 
                   <div align="center"> 
                       <font color="#000000"><input type="radio" name="sollun" value="lun2sol">
                     <font size="2" face="돋움">음 </font></font></div>
                   </td>
                   
                 <td width="30%"> 
                   <div align="center"> 
                       <font color="#000000"><input type="checkbox" name="yoon" value="yoon">
                     <font size="2" face="돋움">윤달 </font></font></div>
                   </td>
                 </tr>
               </table>
                 </td>
         </tr>
         <tr> 
           <td width="483"> 
             <div align="center"> 
               <font color="#000000"><input name="test1" type="button" value="변환" onClick="Resut();">
               <input name="test2" type="reset" value="취소">
               </font></div>
           </td>
         </tr>
         <tr> 
           <td width="483"> 
             <div align="center"><font color="#FF0000" size="2" face="돋움">음력과 
               양력의 상호변환가능한 날짜는 1841~2043 년까지 203년간입니다. </font></div>
           </td>
         </tr>
       </form>
     </table>
   </td>
 </tr>
</table>
</body>
</html>            